#ifndef __BASE_H__
#define __BASE_H__

// :includes
#include <assert.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <time.h>
#include <unistd.h>
#include <pthread.h>
#include "external/glew/include/GL/glew.h"
#include "external/glfw/include/GLFW/glfw3.h"
#include "external/stb/stb_image.h"

// :log
#if defined(__clang__) || defined(__gcc__)
	#define STATIC_ASSERT _Static_assert
#else
	#define STATIC_ASSERT static_assert
#endif

#define panic(x, ...) \
	do {\
		if (!(x)) {\
			fprintf(stderr, "\033[31m[ASSERTION]: %s:%d:\033[0m ", __FILE__, __LINE__);\
			fprintf(stderr, " " __VA_ARGS__);\
			fprintf(stderr, "\n");\
			exit(1);\
		}\
	} while(0)

#define LOG_NORMAL 0
#define LOG_ERROR  91
#define LOG_SUCESS 92
#define LOG_WARN   93
#define LOG_INFO   95

#define log_typed(type, ...)         \
	({                                 \
		printf("\033[%dm", type);        \
		printf(__VA_ARGS__);             \
		printf("\033[%dm", LOG_NORMAL);  \
	})

#define log(...)                          \
	({                                      \
		log_typed(LOG_NORMAL, "[LOG]:    ");  \
		log_typed(LOG_NORMAL, __VA_ARGS__);   \
	})

#define log_sucess(...)                   \
	({                                      \
		log_typed(LOG_SUCESS, "[SUCESS]: ");  \
		log_typed(LOG_SUCESS, __VA_ARGS__);   \
	})

#define log_warn(...)                     \
	({                                      \
		log_typed(LOG_WARN,   "[WARN]:   ");  \
		log_typed(LOG_WARN, __VA_ARGS__);     \
	})

#define log_error(...)                    \
	({                                      \
		log_typed(LOG_ERROR,  "[ERROR]:  ");  \
		log_typed(LOG_ERROR, __VA_ARGS__);    \
	})

#define log_info(...)                     \
	({                                      \
		log_typed(LOG_INFO,   "[INFO]:   ");  \
		log_typed(LOG_INFO, __VA_ARGS__);     \
	})

#define GLCall(x)\
	(\
		clear_gl_error(), \
		x\
	);\
	panic(gl_error_log(#x, __FILE__, __LINE__), "Opengl failed.\n");\

static void clear_gl_error() {
	while(glGetError());
}

static int gl_error_log(const char* function, const char* file, int line) {
	GLenum error;
	while ((error = glGetError())) {
		log_error("[Error code]: %d\n", error);
		log_error("[Error message]: %s\n", gluErrorString(error));
		log_error("[Opengl error]: %s %s: %d\n", function ,file, line);
		return 0;
	}
	return 1;
}

// :types
typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned int u32;
typedef unsigned long long u64;
typedef signed char i8;
typedef signed short i16;
typedef signed int i32;
typedef signed long long i64;
typedef float f32;
typedef double f64;
typedef enum {
	false, true
} b32;

STATIC_ASSERT(sizeof(u8) == 1, "Expected u8 to be 1 byte.");
STATIC_ASSERT(sizeof(u16) == 2, "Expected u16 to be 2 bytes.");
STATIC_ASSERT(sizeof(u32) == 4, "Expected u32 to be 4 bytes.");
STATIC_ASSERT(sizeof(u64) == 8, "Expected u64 to be 8 bytes.");
STATIC_ASSERT(sizeof(i8) == 1, "Expected i8 to be 1 byte.");
STATIC_ASSERT(sizeof(i16) == 2, "Expected i16 to be 2 bytes.");
STATIC_ASSERT(sizeof(i32) == 4, "Expected i32 to be 4 bytes.");
STATIC_ASSERT(sizeof(i64) == 8, "Expected i64 to be 8 bytes.");
STATIC_ASSERT(sizeof(f32) == 4, "Expected f32 to be 4 bytes.");
STATIC_ASSERT(sizeof(f64) == 8, "Expected f64 to be 8 bytes.");
STATIC_ASSERT(sizeof(b32) == 4, "Expected b32 to be 4 bytes.");

// :alloc def
#define TRACE_ALLOCATOR_MEMORY_CAP 1024
#define TRACE_ALLOCATOR_GROW_RATE 0.5

typedef struct {
	void* ptr;
	size_t size;
	const char* file;
	i32 line;
} Traceable_Memory_Block;
#define print_traceable_memory_block(block) ({\
	printf(\
		"%p at %s:%d of %zu bytes\n",\
		(block)->ptr,  (block)->file,\
		(block)->line, (block)->size\
	);\
});

typedef struct {
	Traceable_Memory_Block* blocks;
	u32 blocks_cnt;
	u32 blocks_cap;
} Trace_Allocator;

Trace_Allocator* trace_allocator_new();
void trace_allocator_delete(Trace_Allocator* allocator);
#define trace_allocator_alloc(allocator, size) __trace_allocator_alloc(allocator, size, __FILE__, __LINE__)
void* __trace_allocator_alloc(Trace_Allocator* allocator, size_t size, const char* file, i32 line);
#define trace_allocator_realloc(allocator, ptr, new_cap) __trace_allocator_realloc(allocator, ptr, new_cap, __FILE__, __LINE__)
